ycmd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-01-05 Tue 20:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>YCMD-based Completion</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="shaka" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">YCMD-based Completion</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Introduction</a></li>
<li><a href="#orgheadline6">Installation</a>
<ul>
<li><a href="#orgheadline2">Emacs packages</a></li>
<li><a href="#orgheadline3">Dependency</a></li>
<li><a href="#orgheadline4">YCMD</a></li>
<li><a href="#orgheadline5">Configurations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Introduction</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
YouCompleteMe (YCM) is originally a completion framework for VIM<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, and afterwards splitted into a general server and a client. The general server, namely YCM daemon (YCMD)<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, is able to provide interface to a variety of clients beyond VIM, e.g. Emacs. Moreover, both <code>company</code> and <code>auto-complete</code> can directly utilize what the server/daemon provides.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">Installation</h2>
<div class="outline-text-2" id="text-orgheadline6">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Emacs packages</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
Install the Emacs packages via ELPA, <code>ycmd</code>, <code>company-ycmd</code>, <code>company</code>.
</p>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Dependency</h3>
<div class="outline-text-3" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-sh">pacman -S boost
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">YCMD</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
Install the <code>YCMD</code> to <code>~/.emacs.d/ycmd</code>.
</p>
<div class="org-src-container">

<pre class="src src-sh">cd ~/.emacs.d
git clone https://github.com/Valloric/ycmd.git
cd ycmd
git submodule update --init --recursive
python2 ./build.py --clang-completer --system-libclang --system-boost
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Configurations</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li><code>~/.emacs.d/ycmd/global_config.py</code></li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">cp ~/.emacs.d/ycmd/examples/.ycm_extra_conf.py ~/.emacs.d/ycmd/global_config.py
</pre>
</div>
<p>
After that, customize it to meet your requirements.
</p>
<ul class="org-ul">
<li><code>~/.emacs</code></li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">...

;;; Company
(add-hook 'after-init-hook 'global-company-mode) 
(setq company-idle-delay 0) 
(company-auctex-init) 

;;; Ycmd
(add-hook 'after-init-hook #'global-ycmd-mode)
(set-variable 'ycmd-server-command '("python2" "/home/shaka/.emacs.d/ycmd/ycmd"))
(set-variable 'ycmd-global-config "/home/shaka/.emacs.d/ycmd/global_config.py") 
(company-ycmd-setup)

...
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://valloric.github.io/YouCompleteMe/">http://valloric.github.io/YouCompleteMe/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/Valloric/ycmd">https://github.com/Valloric/ycmd</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: shaka</p>
<p class="date">Created: 2016-01-05 Tue 20:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
